//#include<stdio.h>
//#include<stdlib.h>
//
//int main(void)//邻接矩阵各元素之和为长度为4的通路数，由邻接矩阵求可达矩阵
//{
//	int a[4][4] = { {1,1,0,0},{0,0,1,0},{1,0,0,1},{0,0,1,0} };//邻接矩阵 
//	int b[4][4] = { 0 }, c[4][4] = { 0 }, d[4][4] = { 0 }, e[4][4] = { 0 };//b矩阵为A的平方矩阵， c矩阵为A的四次方矩阵，d矩阵为A的三次方矩阵,e矩阵为可达矩阵
//	int sum = 0, i, j, p;
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			for (p = 0; p < 4; p++)
//				b[i][j] += a[i][p] * a[p][j];
//
//		}
//	}
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			for (p = 0; p < 4; p++)
//				c[i][j] += b[i][p] * b[p][j];
//
//		}
//	}
//	for (i = 0; i < 4; i++)
//		for (j = 0; j < 4; j++)
//		{
//			sum += c[i][j];// 四次方邻接矩阵各元素之和为长度为4的通路数 
//		}
//	printf("通路数有 %d 条\n", sum);
//
//
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			for (p = 0; p < 4; p++)
//				d[i][j] += a[i][p] * b[p][j];
//
//		}
//	}
//	for (i = 0; i < 4; i++)
//		for (j = 0; j < 4; j++)
//		{
//			e[i][j] = a[i][j] + b[i][j] + c[i][j] + d[i][j];//可达矩阵n=4,为A+A^2+A^3+A^4
//			if (e[i][j] > 0)
//				e[i][j] = 1;
//		}
//	printf("可达矩阵为:\n");
//
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", e[i][j]);
//		}
//		printf("\n");
//	}
//
//
//	return 0;
//}
